Feature: Smoke
  Как пользователь
  Я хочу запустить приложение, увидеть главное окно с начальным содержимым и закрыть его
  Таким образом я проверю, что главное окно приложения в целом работает

  Scenario: Открыть и проверить главное окно
    Given Главное окно приложения, открытое пользователем двойным кликом по ярлыку на рабочем столе
    Then В нём есть неактивная кнопка Подключиться
    When Пользователь кликает по стандартной кнопке закрытия окна
    Then Главное окно закрывается, неактивная кнопка Подключиться больше не находится на экране