Feature: Пользовательское состояние выпадающих списков "Канал связи" и "Устройство"
  Как пользователь
  Я хочу запустить приложение в первый раз и выбрать тип канала соединения и тип устройства.
  Затем я хочу закрыть приложение, открыть снова и увидеть, что мой выбор типа канала соединения и типа устройства сохранился.
  Таким образом я проверю, что приложение хранит пользовательское состояние

  Scenario: Открыть приложение в первый раз, выбрать Канал связи и Устройство
    Given Главное окно приложения, открытое пользователем первый раз двойным кликом по ярлыку на рабочем столе
    When Пользователь открывает выпадающий список каналов соединения с подписью '-Выберите канал связи-' и кликает по пункту 'RS232'
    Then В окне есть выпадающий список каналов соединения с подписью 'RS232'
    When Пользователь открывает выпадающий список устройств с подписью '-Выберите устройство-' и кликает по пункту 'Счётчик "МИРТЕК"'
    Then В окне есть выпадающий список устройств с подписью 'Счётчик "МИРТЕК"'
    When Пользователь кликает по стандартной кнопке закрытия окна
    Then Главное окно приложения больше не отображается на экране

  Scenario: Открыть приложение, проверить сохранность выбора типа канала связи и типа устройства после предыдущего сеанса
    Given Главное окно приложения, открытое пользователем двойным кликом по ярлыку на рабочем столе
    Then В окне есть выпадающий список каналов соединения с подписью 'RS232'
    Then В окне есть выпадающий список устройств с подписью 'Счётчик "МИРТЕК"'
    When Пользователь кликает по стандартной кнопке закрытия окна
    Then Главное окно приложения больше не отображается на экране